# GetSpaceAtPoint Method (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DocumentEntryPoint..::..GetSpaceAtPoint Method
DocumentEntryPoint Class See Also
---
Gets a space containing the point.
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetSpaceAtPoint(XYZ) | Gets a space containing the point. (Inherited from Document.) |
| GetSpaceAtPoint(XYZ, Phase) | Gets a space containing the point. (Inherited from Document.) |

# See Also
DocumentEntryPoint Class
DocumentEntryPoint Members
Autodesk.Revit.DB.Macros Namespace